:PROPERTIES:
:ID:       feaabe2a-b4da-4ff6-a8ec-c2eabb5ccc93
:END:
#+TITLE: Shipping a Python service to production
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes

I have a Python service that passed all its tests and I want to ship
it. The build needs compilers and dev headers to install native
dependencies, but in production I want the smallest possible image —
no shell, no package manager, nothing an attacker could use. This is
the classic multi-stage build: build in Debian, run in distroless.

First I set up my Dagger project and install daggerlib:

#+begin_src bash :eval no-export :init yes
dagger init --sdk=python
dagger install github.com/Konubinix/daggerlib
#+end_src

#+RESULTS[c4efdd5f981c9514f8ec08a7690bee71d70c7f38]:

The following is only for testing purposes — it makes the project
use the local daggerlib checkout instead of the published version:

#+begin_src bash :eval no-export :init yes
sed -i '/pin/d; s|"github.com/Konubinix/daggerlib@main"|"../.."|; s|"\.\./\.\.",|"../.."|' dagger.json
#+end_src

#+RESULTS[c0e43fe49406c11e84dec1670d2236fec6890c1b]:

Here is my service — it logs a startup message with timezone info:

#+begin_src python :tangle service.py
"""Minimal service that logs a startup message with timezone info."""
from datetime import datetime

tz = datetime.now().astimezone().tzname()
print(f"service started (timezone: {tz})")
#+end_src

Then I write my Dagger module. The =<<run-distroless>>= reference is
defined further below:

#+begin_src python :tangle .dagger/src/production_images/main.py :noweb yes
from typing import Annotated

import dagger
from dagger import DefaultPath, dag, function, object_type


@object_type
class ProductionImages:
    <<run-distroless>>
#+end_src

* Preparing timezone data for the production image

  Distroless images have no =apt= or =apk= to install timezone data.
  The daggerlib =alpine-tz= helper extracts the timezone files from
  Alpine so they can be injected into distroless images — this is
  what =distroless-python-3-debian= does internally. Here I verify
  the extraction produces the expected files:

  #+NAME: tz_artifacts
  #+begin_src bash :tangle (daggerlib-tangle-test "tz_artifacts") :comments no :padline no
  TMP="${TMP:-$(mktemp -d)}"
  dagger call alpine-tz export --path="$TMP/out" > /dev/null
  ls "$TMP/out" | sort
  #+end_src

  #+RESULTS[a5017cb1acdd53279cece8229cd62f921c503b91]: tz_artifacts
  : localtime
  : timezone

  #+BEGIN_SRC org :tangle (daggerlib-tangle-expected "tz_artifacts") :noweb yes :exports none :comments no :padline no
  <<tz_artifacts()>>
  #+END_SRC

* Running the service in distroless

  For my Python service, I use the distroless Python image. It ships
  only the Python interpreter — no pip, no shell, no debugging tools.
  I inject my service and run it:

  #+NAME: run-distroless
  #+begin_src python
  @function
  async def run_distroless(self, src: Annotated[dagger.Directory, DefaultPath(".")]) -> str:
      """Run a Python service in the distroless image."""
      return await (
          dag.lib().distroless_python3_debian()
          .with_file('/app/service.py', src.file('service.py'))
          .with_exec(['python3', '/app/service.py'])
          .stdout()
      )
  #+end_src

  #+NAME: distroless_service
  #+begin_src bash :tangle (daggerlib-tangle-test "distroless_service") :comments no :padline no
  dagger call run-distroless
  #+end_src

  #+RESULTS[49ea475491aa2230b7dc97912cbbbdf0e37e7e14]: distroless_service
  : service started (timezone: CEST)

  #+BEGIN_SRC org :tangle (daggerlib-tangle-expected "distroless_service") :noweb yes :exports none :comments no :padline no
  <<distroless_service()>>
  #+END_SRC

